Тест_ЗУП_31_КОРП/src/Catalogs/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вакансии</name>
  <basedOn>Document.ЗаявкаНаПодборПерсонала</basedOn>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемыйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПодборПерсонала</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетПрофилюДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритет</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытия</name>
    <type>
      <types>CatalogRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНабора</name>
    <type>
      <types>EnumRef.СпособНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНабора</name>
    <type>
      <types>EnumRef.НазначениеНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПроверка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяОбучение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияСотрудников</name>
    <attributes>
      <name>ДействиеСотрудника</name>
      <type>
        <types>CatalogRef.ДействияСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРаботыСКандидатами</name>
    <attributes>
      <name>ЭтапРаботы</name>
      <type>
        <types>CatalogRef.ЭтапыРаботыСКандидатами</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонАнкеты</name>
      <type>
        <types>CatalogRef.ШаблоныАнкет</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ДанныеПубликацииВакансий/ДанныеПубликацииВакансий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПубликацииВакансий</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоПубликации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолеДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/Catalogs/Вакансии/Forms/НастройкаПечатиОписания/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭлементСТекстомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ЭлементСТекстомЗавершениеВыбора", ЭтотОбъект, Новый Структура("ИмяРеквизита", Элемент.Имя));
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, Элемент.ТекстРедактирования, 
		Элемент.Заголовок);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьИЗакрыть(Неопределено, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Модифицированность 
		И СохранитьДанныеНаСервере() Тогда
		
		Модифицированность = Ложь;
		Оповестить("ЗаписьВариантаПечати", , Вакансия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru = 'Для печати вариант должен быть записан.
			|Продолжить ?'");
		
		Оповещение = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ПечатьЗавершение(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
	
	Вакансия = Параметры.Вакансия;
	
	Если Параметры.Свойство("МестоПубликации", НаименованиеВарианта) Тогда
		
		НаименованиеВариантаПрежнее = НаименованиеВарианта;
		ИдентификаторВакансии = Параметры.ИдентификаторВакансии;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Вакансия", Вакансия);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ДанныеПубликацииВакансий.МестоПубликации КАК МестоПубликации,
		|	ДанныеПубликацииВакансий.ПолеДанных КАК ПолеДанных,
		|	ДанныеПубликацииВакансий.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ДанныеПубликацииВакансий КАК ДанныеПубликацииВакансий
		|ГДЕ
		|	ДанныеПубликацииВакансий.Вакансия = &Вакансия
		|	И ДанныеПубликацииВакансий.МестоПубликации = &МестоПубликации";
		
		Запрос.УстановитьПараметр("МестоПубликации", НаименованиеВарианта);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЭтотОбъект[Выборка.ПолеДанных] = Выборка.Значение;
		КонецЦикла;
		
	Иначе
		
		Модифицированность = Истина;
		
		Описания = ПодборПерсонала.ОписанияВакансийПоУмолчанию(Вакансия);
		Если Описания.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Описания[0]);
		КонецЕсли;
		
		ЭтотОбъект.ПредполагаемыйДоход = СтрШаблон(Нстр("ru = '%1 руб.'"), ЭтотОбъект.ПредполагаемыйДоход);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементСТекстомЗавершениеВыбора(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = НеОпределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = ДополнительныеПараметры.ИмяРеквизита;
	
	Если ЭтотОбъект[ИмяРеквизита] <> РезультатВыбора Тогда
		
		ЭтотОбъект[ИмяРеквизита] = РезультатВыбора;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Результат, ДополнительныеПараметры) Экспорт 
	
	Если СохранитьДанныеНаСервере() Тогда
		
		Модифицированность = Ложь;
		Оповестить("ЗаписьВариантаПечати", , Вакансия);
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьДанныеНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(НаименованиеВариантаПрежнее) 
		И НаименованиеВариантаПрежнее <> НаименованиеВарианта) Тогда
		
		ПодборПерсонала.УдалитьОписанияВакансии(Вакансия, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НаименованиеВариантаПрежнее));
		
	КонецЕсли;
	
	РеквизитыФормы = ПолучитьРеквизиты();
	РеквизитыВарианта = Новый Соответствие;
	
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		
		Если РеквизитФормы.Имя = "НаименованиеВарианта"
			Или РеквизитФормы.Имя = "НаименованиеВариантаПрежнее"
			Или РеквизитФормы.Имя = "ИдентификаторВакансии"
			Или РеквизитФормы.Имя = "Вакансия" Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитыВарианта.Вставить(РеквизитФормы.Имя, ЭтотОбъект[РеквизитФормы.Имя]);
		
	КонецЦикла;
	
	ДанныеОписания = Новый Структура;
	ДанныеОписания.Вставить("Наименование", НаименованиеВарианта);
	ДанныеОписания.Вставить("Реквизиты", РеквизитыВарианта);
	
	ПодборПерсонала.ЗаписатьОписаниеВакансии(Вакансия, ИдентификаторВакансии, ДанныеОписания);
	
	НаименованиеВариантаПрежнее = НаименованиеВарианта;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(НаименованиеВарианта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите наименование сохраняемого варианта.'"), , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Записать(Неопределено);
	КонецЕсли;
	
	Если Не Модифицированность Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.Вакансии", ИдентификаторВакансии,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вакансия), ЭтотОбъект);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
